package b_Operatioin;

public class Operation_01 {
	public static void main(String [] args){
	
		/*
		1. 연산자 기본 
			- 단항연산자 : ++ 한단계 올려줌, -- 한단계 내려줌, + 양수, - 음수, ~, ! not, (타입)캐스팅. 항이 한개다
			- 이항연산자 
			  : 산술연산자 => 사칙연산, % 나머지 ex. 3%2 = 1, <<, >>, >>> 쉬프트 연산자. a+b 항이 두개
			  : 비교연산자 => <, >, <= 작거나 같냐=이 반드시 뒤에, >=, == 같다, != 같지않다, instanceof 
			  : 논리연산자 => & 그리고 , | 쉬프트 역슬러시 or, ^, && 앤드 결합, || 오어결합
			- 삼항연산자 : a+b+c 항이 세개
			  : ?  : 
			- 대입연산자
			  : =, op=, 
			  
		2. 연산우선순위
			- 단항 > 이항 > 삼항 //일반적으로
			- 산술 > 비교 > 논리 > 대입 //대입이 모든것의 마지막 
			- 기본적으로 단항연산자(곱하기같은거 먼저해주는거), 대입연산자(대입은 마지막에 오른쪽에서 왼쪽으로 넘기잖아)를 
			   제외한 모든 연산의 진행방향은 왼쪽에서 오른쪽이다. 
	

		*/
	}
}
